const book = [{
            "id": "000000",
            "name": "乾为天卦：困龙得水",
            "saying": "困龙得水好运交，不由喜气上眉梢。一切谋望皆如意，向后时运渐渐高。",
            "deduct": "词讼和吉，病人痊愈，功名有成，求名大吉。",
            "deductDesc": "乾者健也。刚健不曲中正之谓，故有困龙得水之象。夫困龙得水者，乃是一条蛟龙，久困渊中不得舒展，忽然天降大雨，得雷鸣而起，任意飞腾。占此卦者时来运转之兆也。",
            "explain": "蛟龙久困在渊中，一日飞腾起半空，往来飞腾能变化，从今有祸不成凶。 "
        },
        {
            "id": "000001",
            "name": "天风姤卦：他乡遇友",
            "saying": "他乡遇友喜气欢，须知运气福重添。自今交了顺当运，向后保管不相干。",
            "deduct": "功名有成，家宅平安，失物得见，占病无妨。",
            "deductDesc": "姤者遇也，不期而遇，有他乡遇友之象。所谓他乡遇友者，是行人久困在外，举目无亲，偶遇一友相亲相爱，甚是得意，占此卦者，时来运转之兆也。",
            "explain": "困穷他乡志不伸，忧愁寂寞到于今，时来只因逢知友，面对相谈大放心。 "
        },
        {
            "id": "000010",
            "name": "天火同人卦：仙人指路",
            "saying": "仙人指路过路通，劝君任意走西东。交易求财不费力，生意合伙也相通。",
            "deduct": "婚姻有成，行人归来，走失可见，做事无差。",
            "deductDesc": "同人者与人同也，同心同德，故有仙人指路之象也。夫仙人指路者，是一行人迷路，不知东西，正在忧闷之间，忽有一仙人前来指引正路，占此卦者，无往不利之兆也。",
            "explain": "心中有事不开怀，一切事情犯疑猜，幸遇明人来指路，诸般忧愁自消裁。 "
        },
        {
            "id": "000011",
            "name": "天山遁卦：浓云蔽日",
            "saying": "浓云遮日不光明，劝君切莫远出行。婚姻求财皆不吉，须防口舌到门庭。",
            "deduct": "占病不安，讼事见官，功名不成，事不遂心。",
            "deductDesc": "遁者避也，退避不出。故有浓云蔽日之象。所谓浓云蔽日者，是正当大午时节，太阳照耀，忽然来了一块浓云，遮住其光。占此卦者，谋事不遂之兆也。",
            "explain": "太阳出没在天边，只喜光明不喜暗，若遇浓云来遮蔽，定主恍惚事不全。 "
        },
        {
            "id": "000100",
            "name": "天泽履卦：凤鸣歧山",
            "saying": "凤凰落在西岐山，长鸣几声出圣贤。天降文王开基业，富贵荣华八百年。",
            "deduct": "出门有益，求财必准，疾病皆除，诸事平稳。",
            "deductDesc": "履者蹑也，有所蹑而不进，故有凤鸣歧山之象。夫凤鸣歧山者，是凤凰祥瑞之鸟，人不常见，忽然鸣于歧山之上，随出文王治也，也称圣德，大兴周帮，占此卦者，主国家贞祥之兆也。",
            "explain": "凤凰落在西歧山，鸣了三声出圣贤，天降文王开基业，富贵荣华八百年。 "
        },
        {
            "id": "000101",
            "name": "天水讼卦：二人争路",
            "saying": "二人争路未肯降，占着此卦费主张。交易出行有阻隔，生意合伙有平常。",
            "deduct": "月令不济，光生闲气，好事难成，求财费力",
            "deductDesc": "讼者辨也，事有争取，故有二人争路之象也。夫二人争路者，是一条小路，非常窄狭，恰来二人相撞一处，俱要争先，皆不相让。占此卦者，事不顺利也。"
        },
        {
            "id": "000110",
            "name": "天雷无妄卦：鸟被笼牢",
            "saying": "鸟如笼中难出头，占着此卦不自由。谋望求财不定准，疾病忧犯口舌愁。",
            "deduct": "出门不遇，求财不利，婚姻走失，疾病不宜。",
            "deductDesc": "无妄者，无所期望也，故有鸟被笼牢之象也。夫鸟被笼牢者，是一莺歌飞去寻食，不料被人陷入笼中，虽然舌尖嘴巧，难以飞腾。占此卦者，主事忧不遂心之兆也。",
            "explain": "飞鸟失机落笼中，纵然想飞不能行，目下只宜守一份，妄想扒高万不能。 "
        },
        {
            "id": "000111",
            "name": "天地否卦：虎落深坑",
            "saying": "虎落陷坑不堪言，前进容易退后难。谋望不遂自己便，疾病口舌有牵连。",
            "deduct": "占财可成，贵人远行，出行不宜，事事晚成。",
            "deductDesc": "否者塞也，闭塞不通。夫虎落深坑者，是一只猛虎下山寻食，不料被人掘下一深坑，虎落下去，总有威风不能伸展，占此卦者，凶多吉少之兆也。",
            "explain": "猎人掘下一深坑，要使猛虎入坑中，若不提防掉下去，少主吉来多主凶。 "
        },
        {
            "id": "100000",
            "name": "泽天夬卦：游蜂脱网",
            "saying": "游蜂脱网喜无边，添财进口福禄连。外则通达内则顺，富贵荣华胜以前。",
            "deduct": "词讼了结，疾病除根，求财到手，任意遂心。",
            "deductDesc": "决者决也，刚健而悦，故有游蜂脱网之象也。所谓游蜂脱网者，如同一群游蜂穿过柳，误入蜘蛛网内，幸而大风所过，将网吹破，使蜂脱离灾难，任意飞腾，占此卦者，逢凶化吉之兆也。",
            "explain": "蜘蛛之网似天牢，粘住游蜂翅翎毛，幸得大风吹破网，脱离灾难又逍遥 "
        },
        {
            "id": "100001",
            "name": "泽风大过卦：夜梦金钱",
            "saying": "夜梦金银醒来空，求名求利大不通。婚姻难成交易散，走失行人不见踪。",
            "deduct": "月令不和，好事难谋，凡事忍耐，休要琢磨。",
            "deductDesc": "大过者祸也，二阴不胜其重，故有夜梦金钱之卦。夫夜梦金钱者，是一人思想求财，全不能得，一日夜梦许多金银，得了极易，醒来却是乌有，占此卦者，谋望虚化之兆也。",
            "explain": "夜梦金钱醒来空，醒来总是一文无，目下只是求本分，思念只是空劳神。 "
        },
        {
            "id": "100010",
            "name": "泽火革卦：旱苗得雨",
            "saying": "苗逢旱天渐渐衰，幸得天恩降雨来。忧去喜来能变化，求谋诸事遂心怀。",
            "deduct": "出行大吉，走失能找，行人来信，百般凑巧。",
            "deductDesc": "革者变革也，凶变为吉，故有旱苗得雨之象。所谓旱苗得雨者，是春苗久旱，夏天无雨，则苗枯萎，幸得油然作云，沛然作雨，苗则勃然而生，占此卦者，时来运转之兆也。",
            "explain": "旱苗得雨茂堂堂，交易求财也相当，婚姻合伙皆如意，官司疾病皆无妨。 "
        },
        {
            "id": "100011",
            "name": "泽山咸卦：萌芽出土",
            "saying": "脚踏棒槌转悠悠，时运不来莫强求。幸喜今日时运转，自有好事在后头。",
            "deduct": "谋望有成，出门可行，走失来信，疾病安宁。",
            "deductDesc": "咸者交感也，天地感而万物生，故有萌芽出土之象也。所谓萌芽出土者，是坡内之草，到了秋冬之时，又被牧童烧出，荒荔俱枯，幸遇阳转春回，复又是发芽，占此卦者，时来运转之兆也。",
            "explain": "运去黄金失色，时来捧槌发芽，月令极好不差，且喜心宽意大。 "
        },
        {
            "id": "100100",
            "name": "兑为泽卦：趁水和泥",
            "saying": "这个卦象真有趣，觉着做事不费力。休要错过这机会，事事就觉遂心意。",
            "deduct": "口舌消散，疾病痊愈，求财到手，谋事遂心。",
            "deductDesc": "兑者悦也，临事而悦，故有趁水和泥之象也。所谓趁水和泥者，如同兴工动土，将要和泥，忧井甚远，幸得天降大雨沟壕皆满，趁水和泥纯天费少，占此卦者，如意凑巧之兆也。",
            "explain": "这个卦象真有趣，做事觉着不费力，休要错过这机会，整整觉着遂心意。 "
        },
        {
            "id": "100101",
            "name": "泽水困卦：撮梯抽杆",
            "saying": "时运不来有人欺，千方百计费商议。明明与你说好话，撮上杆去抽了梯。",
            "deduct": "当交君子，莫听小人，凡事谨慎，永不受穷。",
            "deductDesc": "困者困穷也，而不能自振，故有撮梯抽杆之象也。所谓撮梯抽杆者，如二人商议摸雀，已经撮上杆去，又把梯子抽了，心中恍惚不定，占此卦者，谋望不称之兆也。",
            "explain": "时运不来好伤怀，撮上杆去把梯拈，一个小雀未到手，转了上去下不来。 "
        },
        {
            "id": "100110",
            "name": "泽雷随卦：推车靠涯",
            "saying": "推车靠堰道路干，谋望求财不费难。婚姻出行无阻隔，疾病口舌保平安。",
            "deduct": "苦极生荣，喜气盈盈，一切做事，大运亨通。",
            "deductDesc": "随者顺也，已能顺物，故有推车靠涯之象。夫推车靠涯者，是一人推车行于泥中，费尽力气忽然来到涯前，行于人道，渐觉松快，占此卦者，步步登高之兆。",
            "explain": "泥里步踏这几年，推车靠涯在眼前，目下就该再使力，推上涯去发财源。 "
        },
        {
            "id": "100111",
            "name": "泽地萃卦：鲤鱼变龙",
            "saying": "鲤鱼化龙喜气来，口舌疾病永无灾。愁疑从此都消散，祸门闭来福门开。",
            "deduct": "鲤鱼化龙，喜气重重，求财到手，做事有功。",
            "deductDesc": "萃者升聚也，万物萃聚，故有鲤鱼化龙之象也。所谓鲤鱼化龙者，是一个鲤鱼被网惊瞳，游到龙门下，急忙跳跃而过，身化成龙，占此卦者，飞龙在天，利见大人之兆也。",
            "explain": "游鱼戏水被网惊，跳过龙门身化龙，三尽杨柳垂金钱，万朵桃花显你能 "
        },
        {
            "id": "010000",
            "name": "火天大有卦：砍树摸雀",
            "saying": "砍树摸雀做事牢，是非口舌自然消。婚姻合伙不费力，若问走失未脱逃。",
            "deduct": "恍惚不做，拿稳下手，若求名利，到处自有。",
            "deductDesc": "大有者，所有大也，上下相之象，故有砍树摸雀之兆。夫砍树摸雀者，是一人偶见树上有一蒿雀鸟，有心上去摸之，恐其恍忽遂将树砍倒，拿稳的，占此卦者，做事稳当之兆也。",
            "explain": "此卦占之好处多，砍倒大树摸莺雀，稳稳当当拿在手，别人空看摸不着。 "
        },
        {
            "id": "010001",
            "name": "火风鼎卦：渔人得利",
            "saying": "若占此卦喜自然，求名求利两周全。婚姻合伙皆如意，生意兴隆乐自然。",
            "deduct": "出门有益，交易可成，官事无妨，诸事安宁。",
            "deductDesc": "鼎者，烹饪之物也，烹以养贤，故有渔人得利之象。所谓渔人得利者，是一渔翁湖边捕鱼，又见莺弄蛤蜊，蛤蜊弄莺，向前齐得，甚是得意。占此卦者，一举两全之兆也。",
            "explain": "莺弄蛤蜊落沙滩，蛤蜊弄莺两翅扇，渔翁进前双得利，走失行人即日还 "
        },
        {
            "id": "010010",
            "name": "离为火卦：天官赐福",
            "saying": "占此卦者遇天宫，富禄必然降人间。一切谋望皆吉庆，愁闲消散主平安。",
            "deduct": "月令皆善，诸事方便，出门见喜，灾消病散。",
            "deductDesc": "离者所也，阴丽乎阳，故有天官赐福之象也。夫夫官赐福者，是福禄之神在人运中，必然逢凶化吉，遇祸成福，无不称心，占此卦者，主享有成，发福生财之托也。",
            "explain": "官长来占主高升，庄农人家福禄增，生意买卖利也厚，匠人艺人大运通。 "
        },
        {
            "id": "010011",
            "name": "火山旅卦：宿鸟焚巢",
            "saying": "飞鸟树上筑高巢，小人使计用火烧。如占此卦大不利，一切谋望枉徒劳。",
            "deduct": "求财费力，行人未还，走失无信，找事也难。",
            "deductDesc": "旅者羁旅也，不得舒展，故有宿鸟焚巢之象也。所谓宿鸟焚巢者，如同一宿鸟在树上垒窝安身，不料被小人举火焚巢，占此卦者，主做事无成之兆也。",
            "explain": "飞鸟树上驿高巢，小人用计使火烧，君占此卦为不吉，一切谋望枉徒劳。 "
        },
        {
            "id": "010100",
            "name": "火泽睽卦：贩猪卖羊",
            "saying": "此卦占之运气歹，如同太公做买卖。贩猪羊快贩牛迟，猪羊齐贩断了宰。",
            "deduct": "占名不利，占利不全，疾病不愈，做事更难。",
            "deductDesc": "睽者乘异也，性相违充，故有贩猪卖羊之象。所谓贩猪卖羊者，是姜太公不时也，贩猪羊快，贩羊猪快，猪羊齐贩，密探了宰杀。占此卦者，主事不遂心，弄巧成拙之兆也。",
            "explain": "贩卖猪羊运不遂，如同太公作买卖，贩猪羊快贩羊迟，猪羊齐贩断了宰。 "
        },
        {
            "id": "010101",
            "name": "火水未济卦：太岁月建",
            "saying": "太岁入运事多愁，婚姻财帛莫强求。交易出门走见吉，走失行人不露头。",
            "deduct": "官讼不吉，口舌有灾，目下忍耐，过月无妨。",
            "deductDesc": "未济者，事未成也，火水不交，故有太岁月建之象也。所谓太岁月建者，是杨任奉命巡营，即有张奎旭夜偷营劫寨，只得竟力巡防，占此卦者，主有小人暗害，内里生心之兆。",
            "explain": "凡事需要多留心，提防偷营劫寨人，后封太岁多凶煞，时加谨慎祸不侵。 "
        },
        {
            "id": "010110",
            "name": "火雷噬磕卦：饥人遇食",
            "saying": "运拙如同身受饥，幸得送饭又遇食。适口充肠心欢喜，忧愁从此渐消移。",
            "deduct": "见官有理，出门见喜，婚姻成全，事事如意。",
            "deductDesc": "噬者啮也，嗑者合也，是故有饥人遇食之象也。夫饥人遇食者，是一人三日未食，饥饿不能出门，偶遇富人送饭以赠得饱，而起渐渐兴旺，占此卦者，诸事凑巧之兆也。",
            "explain": "运拙如同身受饥，有人面前送饭衣，适口充腹心欢喜，忧愁从此渐消移。 "
        },
        {
            "id": "010111",
            "name": "火地晋卦：锄地得金",
            "saying": "锄地锄去苗里草，谁想财帛将人找，谋望求财皆如意，这个运气也算好。",
            "deduct": "进退两难，不敢强辩，拨云见日，该你出现。",
            "deductDesc": "晋者进也，前进后益，故有锄地得金之象也。所谓锄地得金者，是一农夫锄地抱垄，甚是劳苦，一日锄头地锄出金子来，占此卦者，出来逢转之兆也。",
            "explain": "衣人地里示锄草，谁知财帛将人找，一锄锄出金子来，这个运气也算好。 "
        },
        {
            "id": "110000",
            "name": "雷天大壮卦：工师得木",
            "saying": "卦占工师得大木，眼前该着走上路。时来运转多顺当，有事自管放心做。",
            "deduct": "出门吉利，口舌远避，疾病皆除，行人即至。",
            "deductDesc": "大壮者盛也，事得兴隆，故有工师得木之象。所谓工师得木者，如同一个木匠久无材料，忽然一日得到一大木，又做生意，占此卦者，运气指头之兆也。",
            "explain": "卦上工师得大木，眼前该着走上路，时来运转多顺当，有事自管放心做。 "
        },
        {
            "id": "110001",
            "name": "雷风恒卦：鱼来撞网",
            "saying": "鱼来撞网乐自然，卦占行人不久还。交易婚姻两成就，谋望求财不费难。",
            "deduct": "出行凑巧，有病就好，虽有口舌，自然消了。",
            "deductDesc": "恒者外也，于其道，故有鱼来撞网之象也。夫鱼来撞网，如同一个渔翁，心想拿鱼，到了河边，撒下网去，其鱼自投网中，渔翁得鱼甚是欢喜，占此卦者，百事如意之兆也。",
            "explain": "渔翁寻鱼运气好，鱼来撞网跑不了，别人使劲候不来，谁知一到就凑巧。 "
        },
        {
            "id": "110010",
            "name": "雷火丰卦：古镜重明",
            "saying": "古镜昏暗好几年，一朝磨明似月圆。君子谋事占此卦，时来运转乐自然。",
            "deduct": "出行有益，交易得利，疾病见好，求名遂意。",
            "deductDesc": "丰者大也，以明而动，故有古镜重明之象也。所谓古镜重明者，似一多年古镜，日久不甚光明，忽然遇一匠人磨明，占此卦者，时来运转也。",
            "explain": "古镜昏暗好多年，一朝磨明似月圆，君子谋事逢此卦，时来运转喜自然。 "
        },
        {
            "id": "110011",
            "name": "雷山小过卦：急过独桥",
            "saying": "行人路过独木桥，心内惶恐眼里跳。爽利保保过得去，慢行一步不安牢。",
            "deduct": "求财到手，官事平常，目下不吉，交节自强。",
            "deductDesc": "小过者阳也，阳过于阴，故有急过独桥之象也。所谓急过独桥之象者，是一行人来自河边，遇见一独木小桥，甚是迟疑，占此卦者，主进则有功，退则无益之兆也。",
            "explain": "行人路过独木桥，心中恍惚眼里瞧，爽得保你过得去，慢走一步不安牢。 "
        },
        {
            "id": "110100",
            "name": "雷泽归妹卦：缘木求鱼",
            "saying": "求鱼须当向水中，树上求之不顺情。受尽爬揭难遂意，劳而无功事不成。",
            "deduct": "月令不好，做事颠倒，打算到手，遂心的少。",
            "deductDesc": "归妹者，少女从长男，阴阳不交，故有缘木求鱼之象也。所谓缘木求鱼者，如同一人思想拿鱼，不向水中去取，却上树上去求，焉能得鱼乎？占此卦者，谋望不遂之兆也。",
            "explain": "求鱼须得向水中，树上求之万顺通，受尽辛苦难遂意，劳而无功运平平。 "
        },
        {
            "id": "110101",
            "name": "雷水解卦：五关脱难",
            "saying": "五关脱难运抬头，劝君须当把财求。交易出行有人助，疾病口舌不用愁。",
            "deduct": "疾病大好，行人来早，谋望成全，诸般凑巧。",
            "deductDesc": "解者难之散也，遇难即解，故有五关脱难之象。所谓五关脱难者，即黄飞虎过五关被获，幸得哪吒相救，方得出差点儿此卦者，有祸不成凶之兆也。",
            "explain": "目下月令如过关，千辛万苦受熬煎，时来临相有人救，任意所为有相干。 "
        },
        {
            "id": "110110",
            "name": "震为雷卦：金钟夜撞",
            "saying": "占者逢之撞金钟，时来运转响一声。谋事求财不费力，交易合伙大亨通。",
            "deduct": "求名遂意，做事遂心，走失行人，自然有音。",
            "deductDesc": "震者动也，震惊百里，故有金钟夜撞之象。所谓金钟撞者，是一口金钟被埋泥中，夜里被人当做石头，撞敲了一下，声音响亮占此卦者，诸事有成之兆也。",
            "explain": "一颗金钟在淤泥，人人拿之当顽石，忽然一日钟悬起，响亮一声天下知。 "
        },
        {
            "id": "110111",
            "name": "雷地豫卦：青龙得位",
            "saying": "青龙得意喜气生，谋望求财事有成。婚姻出行无阻隔，是非口舌的安宁。",
            "deduct": "交易即成，行人即归，头绪有准，合伙有利。",
            "deductDesc": "豫者乐和也，人心乐和，故有青龙得位之象。夫青龙得位者，是妆太公路遇龙须虎，力拔不出，方拜太公为师，占此卦者，逢凶化吉之兆也。",
            "explain": "太公插下杏黄旗，收妖为徒归而歧，自比青龙得了位，一切谋望百事宜。 "
        },
        {
            "id": "001000",
            "name": "风天小畜卦：密云不雨",
            "saying": "浓云密排下雨难，盼望行人不见还。交易出行空费力，婚姻求谋是枉然。",
            "deduct": "月令中平，忍耐从容，疾病口舌，交节安宁。",
            "deductDesc": "小畜者，以阴畜阳也，有气无质，故有密云不雨之象也。夫密云不雨者，如同天旱太甚，田苗枯槁，从皆望云盼雨，谁想密布浓云，而无雨，占此卦者，暂且忍耐之兆也。",
            "explain": "苗逢旱天尽焦梢，谁想云浓雨不浇，农民仰天长叹气，事从虚来莫心高。 "
        },
        {
            "id": "001001",
            "name": "巽为风卦：孤舟得水",
            "saying": "泛舟得水离沙滩，出外行人早回家。是非口舌皆无碍，婚姻合伙更不差。",
            "deduct": "功名称意，求财得利，交易可成，疾病痊愈。",
            "deductDesc": "巽者顺也，巽顺而入，故有孤舟得水之象也。所谓孤舟得水，如同一孤舟，落在沙滩上，久不转动，忽然大雨倾盆，河水涨溢，其船得撑渡，占此卦者，困极生福之兆也。",
            "explain": "一只孤舟落沙滩，有杭无水时远难，时逢大雨江河满，不用费力任往还。 "
        },
        {
            "id": "001010",
            "name": "风火家人卦：镜里观花",
            "saying": "镜里观花休认真，谋望求财不遂心。交易慢成婚姻散，走失行人无音信。",
            "deduct": "找人不遇，疾病未愈，求名不准，官事不宜。",
            "deductDesc": "家人者，一家之人也，内外各失其真，故有镜里观花之象也。所谓镜里观花者，是一人对镜梳妆，见镜中鲜花可爱，欲意取之而不可得，占此卦者，谋望不实之兆也。",
            "explain": "一朵鲜花镜中开，看着极好取不来，劝君不可镜花爱，凡事不可巧安排。 "
        },
        {
            "id": "001011",
            "name": "风山渐卦：俊鸟出笼",
            "saying": "俊鸟幸得出笼中，脱离灾难显威风。一朝得志凌云去，东南西北任意行。",
            "deduct": "合伙如意，迁移如心，买卖兴旺，求财十分。",
            "deductDesc": "渐者进也，以渐而进；故有俊鸟出笼之象。所谓俊鸟出笼者，如同一俊鸟被笼罩住，心中忧闷，忽然有一顽童误开笼门，其鸟乘机而出，任意飞腾，占此卦者，吉庆之兆也。",
            "explain": "俊鸟幸得出笼中，脱了灾难显威风，直上青云福立至，东西南北任意行。 "
        },
        {
            "id": "001100",
            "name": "风泽中孚卦：行走薄冰",
            "saying": "路上行人色匆匆，过河无桥遇薄冰。小心谨慎过得去，一步错了落水中。",
            "deduct": "薄冰甚险，行人难禁，若占此卦，凡事小心。",
            "deductDesc": "孚者信也，而中正应呼天，故有行走薄冰之象也。所谓行走薄冰者，如同一人过河无桥，冰上行走，不想走到中间，其冰甚薄，心中着实惊恐，占此卦者，凡事当缓，做事不可急迫也。",
            "explain": "路上行人在隆冬，过河无桥走薄冰，小心谨慎过得去，一步错了落水中。 "
        },
        {
            "id": "001101",
            "name": "风水涣卦：隔河望金",
            "saying": "隔河望见一锭金，欲取河宽水又深。指望钱财难到手，日夜思想妄费心。",
            "deduct": "婚姻不济，合伙无利，交易出行，总不如意。",
            "deductDesc": "涣者散也，散而不聚，故有隔河望金之象也。所谓隔河望金者，如同一人隔河望见一锭金子，有心取得，但河宽水深，全过不去，纵有财帛，干看不能到手。占此卦者，诸事费力徒劳之兆也。",
            "explain": "隔河望见一锭金，欲取河宽水又深，指望资财难到手，昼夜思想枉费心。 "
        },
        {
            "id": "001110",
            "name": "风雷益卦：枯木开花",
            "saying": "时来运转喜气发，多年枯木又开花。枝叶重生多茂盛，几人见了几人夸。",
            "deduct": "交易有成，见官有理，走失得见，出门见喜。",
            "deductDesc": "益者增益也，有益无损，故有枯木开花之象也。所谓枯木开花者，似一枯朽之木，久不发芽，小人一见欲伐之，幸得天意运转，雨来润之而又开花，占此卦者，困极生荣之兆也。",
            "explain": "时来运转吉气发，多年枯木又开花，花枝重重多茂盛，几人见了几人夸。 "
        },
        {
            "id": "001111",
            "name": "风地观卦：旱荷得水",
            "saying": "花遇甘露旱逢河，生意买卖利息多。婚姻自有人来助，出门永不受折磨。",
            "deduct": "占讼得利，占病即愈，占信见得，谋事得意。",
            "deductDesc": "观者务人所仰也，故有旱荷得水之象。夫旱荷得水者，是一池荷花，正当天旱之时，池干花枯，全不茂盛，忽然天降大雨，花又茂盛。占此卦者，得贵人扶助之兆也。",
            "explain": "事比荷花出水中，旱日不如往日同，幸得逢水来灌，枝叶重鲜花更红。 "
        },
        {
            "id": "101000",
            "name": "水天需卦：明珠出土",
            "saying": "明珠土埋日久深，无光无毫到如今。忽然大风吹去土，自然显露又重新。",
            "deduct": "谋望有成，婚姻最合，求财如意，也喜动挪。",
            "deductDesc": "需者须也，得时而动，故有明珠出土之象也。夫明珠出土者，是一明珠土埋日久，不曾显现，忽然被风将土吹去，明珠得以出现，见者得此明珠不无珍爱，占此卦者，时来运转之兆也。",
            "explain": "明珠土埋日久深，无光天亮到如今，忽然大风吹上去，自然显露又重新。 "
        },
        {
            "id": "101001",
            "name": "水风井卦：枯井生泉",
            "saying": "枯井破了已多年，一朝涌泉出水新。资生济渴人称羡，时来运转乐自然。",
            "deduct": "精神渐爽，富禄日增，出入皆吉，百事亨通。",
            "deductDesc": "井者穴通也，水从井出，故有枯井生泉之象。所谓枯井生泉者，如有一眼井，久枯不汲，已经枯竭，不料重遭阴雨，泉从地出，细水能以长流，占得此卦者，时来运转之兆也。",
            "explain": "枯井废了好多年，一朝泉出流水鲜，滋生万物人称羡，时来运转乐自然。 "
        },
        {
            "id": "101010",
            "name": "水火既济卦：金榜题名",
            "saying": "金榜之上提姓名，不负当年苦用功。人逢此卦多吉庆，一切谋望大亨通。",
            "deduct": "月令吉善，找人寻见，走失能找，口舌消散。",
            "deductDesc": "既济者，既成之事也，故有金榜题名之象。所谓金榜题名者，是一应考之人上京会试，考罢三场，忽然金榜题名，甚是得意，占此卦者，吉庆如意之兆也。",
            "explain": "金榜上面题姓名，不负当年窗下功，人逢此卦多吉庆，一切谋望大亨通。 "
        },
        {
            "id": "101011",
            "name": "水山蹇卦：雨雪满途",
            "saying": "大雨倾地雪满天，路上行人苦又难，拖泥带水费尽力，事不遂心且耐烦。",
            "deduct": "行人未至，投向无门，好事难成，求名不准。",
            "deductDesc": "蹇者难也，足不难前进，行走艰困，故有雨雪满途之象。所谓雨雪满途者，是一行人，到了半途中，先雨后雪，泥泞难行，甚是费力，占此卦者，诸事绵绵，谋望不准之兆也。",
            "explain": "大雨倾地雪满天，路上行人苦又寒，托泥带水费尽力，事不遂心且耐烦。 "
        },
        {
            "id": "101100",
            "name": "水泽节卦：斩将卦神",
            "saying": "时来运转喜气生，登台封神姜太公。到此诸神皆退位，纵然有祸不成凶。",
            "deduct": "月令高强，声名大杨，走失有信，官事不妨。",
            "deductDesc": "节者，有限而止也，故有斩将封神之象。所谓斩将封神者，是姜太公灭纣王之后，在万象山封神，一切鬼魂尽赴台前，俱各受封得位。占此卦者，百无禁忌之兆也。",
            "explain": "时来运转姜太公，登占封神喜气生，到此诸神皆退位，总然有祸不成凶。 "
        },
        {
            "id": "101101",
            "name": "坎为水卦：水底捞月",
            "saying": "一路明月照水中，只见影儿不见踪。愚人当财下去取，摸来摸去一场空。",
            "deduct": "求名不遂，疾病未愈，婚姻未成，合伙不利。",
            "deductDesc": "坎者陷也，劳而无功也，故有水底捞月之象。夫水底捞月者，是一轮明白照入水中，甚是真切，来了一人，只当是元忠，下水去捞，如何捞得到？占此卦者，受苦而无功之兆也。",
            "explain": "一轮明月照水中，只见影儿不见踪，愚人当财下去娶，摸来摸去一场空。 "
        },
        {
            "id": "101110",
            "name": "水雷屯卦：乱丝无头",
            "saying": "风刮乱丝不见头，颠三倒四犯忧愁。慢行缓来头有绪，急促反惹不自由。",
            "deduct": "疾病未好，婚姻不巧，口舌琐碎，做事颠倒。",
            "deductDesc": "屯者，物始生尴未遇也，故有乱丝无头之象。夫乱丝无头者，乃一机户在室外落丝，忽然狂风大起，将丝刮乱，左撕右扯找不出头来，占此卦者，主颠倒错乱之兆也。",
            "explain": "风刮乱丝不见头，逢着闲事且暂推，慢从缓来方可顺，谋贵求财心不遂。 "
        },
        {
            "id": "101111",
            "name": "水地比卦：船得顺风",
            "saying": "顺风行船撒起棚，上天又助一篷风。不用费力逍遥去，任意而行大亨通。",
            "deduct": "走失可寻，见官有理，婚姻求名，保管恭喜。",
            "deductDesc": "比者铺也，相辅佐之意，故有船得顺风之象也。夫船得顺风者，如同一只粮船载重水浅，船行不动，忽然起了顺风，船蓬得风而走，全不费力，占此卦者，主无事不利之兆也。",
            "explain": "顺风行船柱起蓬，上天又助一阵风，不用费力逍遥去，任意而行走西东。 "
        },
        {
            "id": "011000",
            "name": "山天大畜卦：阵势得开",
            "saying": "忧愁常锁两眉间，千头万绪挂心间。从今以后打开阵，任意而行不相干。",
            "deduct": "交节行人，出门大吉，好运有信，百事和顺。",
            "deductDesc": "大蓄者，所蓄之聚也，故有阵势得开之象也。阵势得开者，是广成子在灯火阵遭困，急将翻天印举起来，打坏群仙阵，破开阵势，占此卦者，再无阻隔之兆也。",
            "explain": "忧愁常琐两眉头，千头万绪挂心间，从今以后打开阵，任意而行不相干。"
        },
        {
            "id": "011010",
            "name": "山火贲卦：喜气盈门",
            "saying": "时来运转锐气周，窈窕淑女君子求。钟古乐之大吉庆，占着此卦喜临头。",
            "deduct": "出门吉祥，诸事顺当，失物见得，月令高强。",
            "deductDesc": "贲者饰也，物之有饰，故有喜气盈门之象。夫喜气盈门者，是周文王生有圣德，又得圣女形为配之，于是内有家齐，外而国治，三分天下有其二，占此卦者，如意称心也。",
            "explain": "时来运转瑞气周，窈窕淑女君子求，钟鼓乐之大吉庆，占者逢之喜临头。 "
        },
        {
            "id": "011001",
            "name": "山风蛊卦：推磨岔道",
            "saying": "卦中象如推磨，顺当为福反为祸。心中有数事改变，凡事尽从忙里错。",
            "deduct": "出行无益，行人未回，走失难见，诸事莫为。",
            "deductDesc": "蛊者坏也，极而有此事，故有推磨岔道之象也。夫推磨岔道者，是一马拉磨不走圈道，而走出磨房，将磨拉翻不能顺转，人心甚是恍惚，占此卦者，不顺当之兆也。",
            "explain": "卦中爻象如推磨，顺当为福反为祸，心中有意且迟缓，凡事尽从忙里错。 "
        },
        {
            "id": "011011",
            "name": "艮为山卦：矮巴够枣",
            "saying": "财帛常打心中走，可惜眼前难到手。不如一时且忍耐，遇着闲事休开口。",
            "deduct": "好事难成，走失难寻，凡事谨慎，交节安宁。",
            "deductDesc": "艮者至也，止于极而不进也，故有矮巴够枣之象。所谓矮巴够枣者，是一矮巴人，心想吃枣，走在树下，不料树高人矮，干着急够不着，占此卦者，主事干急不顺也。",
            "explain": "财帛常打心中走，可恨眼前难到手，不如暂时且忍耐，逢者闲事休开口。 "
        },
        {
            "id": "011100",
            "name": "山泽损卦：推车掉耳",
            "saying": "时运不至费心多，比作推车受折磨。山路崎岖掉了耳，左插右安安不着。",
            "deduct": "时运不遂，不可胡为，交节换月，自然夺魁。",
            "deductDesc": "损者减也，损内益外，故有推车掉耳之象。所谓堆车掉耳者，如同车夫推下涯，不料下至中间，掉下耳来，左右安不上，占此卦者，主事费力之兆也。",
            "explain": "推车掉耳路难行，心中打算力不能，君子占此琐碎卦，总然无灾也困穷。 "
        },
        {
            "id": "011101",
            "name": "山水蒙卦：小鬼偷钱",
            "saying": "卦中气象犯小耗，谋望求财枉徒劳。婚姻合伙有人破，交易出行犯唠叨。",
            "deduct": "为人仔细，挣钱费力，有心学好，小鬼偷去。",
            "deductDesc": "蒙者味也，常味不明，故有小人偷钱之象也。夫小人偷钱者，如同一人时运不好，全不宽愉，遇有钱之时，无论多少，使不出来，就如小鬼偷钱一般，占此卦者，时运不祥之兆也。",
            "explain": "卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，作事必然受苦劳。 "
        },
        {
            "id": "011110",
            "name": "山雷颐卦：渭水访贤",
            "saying": "文王访贤在渭滨，谋望求财事遂心。交易出行方如意，疾病口舌可离身。",
            "deduct": "渭水访贤，大吉大利，占着此卦，好了运气。",
            "deductDesc": "颐者养也，口食物以自养，故有渭水访贤之象也。夫渭水访贤者，是姜太公不得志时，在渭水河边钓鲁，文王闻之亲来访请，上车载而归，加号为留父，占此卦者，否极泰来也。",
            "explain": "太公独钓渭水河，手执丝杆忧愁多，时来又遇文王访，自此永不受折磨。 "
        },
        {
            "id": "011111",
            "name": "山地剥卦：莺鹊同林",
            "saying": "鹊遇天晚宿林中，不知林内先有鹳。虽然同处心生恶，卦外逢之事非轻。",
            "deduct": "先难后易，谋事不易，交过节令，忧愁变喜。",
            "deductDesc": "剥者落也，阴腾阳落，故有莺鹊同林之象。莺鹊册林者，如同有一小鹊，天晚枝宿大林之中，想有莺在内，莺见鹊即生恶意，占此卦者，主小人暗算，干事无成之兆也。",
            "explain": "鹊遇天晚入林中，不想内里先有莺，莺见小鹊生恶意，卦若逢之是非轻。 "
        },
        {
            "id": "111000",
            "name": "地天泰卦：喜报三元",
            "saying": "喜报三元运气强，谋望求财大吉祥。交易出行多得意，是非口舌总无妨。",
            "deduct": "婚姻有成，行人即至，失物可寻，诸般凑巧。",
            "deductDesc": "泰者通泰也，诸事通泰，故有喜报三元之象也。夫喜报三元者，是一应考之人，考罢三场，专候结完，忽见有报喜人来，甚是欢喜，占此卦者，大吉大利之兆也。",
            "explain": "学问满腹入科场，三元及第得意回，从此解去愁和闷，且喜平地一声雷。 "
        },
        {
            "id": "111001",
            "name": "地风升卦：指日高升",
            "saying": "指日离升气象新，走失行人有音信。功名出行遂心好，疾病口舌皆除根。",
            "deduct": "求财到手，谋事可成，寻人得见，家宅安宁。",
            "deductDesc": "升者进也，似乎升阶，故有指日高升之象。所谓指日高升者，是一官员，夜梦红日东升，醒来即有圣旨降临，加官晋职，高升三级，占此卦者，时来运转，发富生财，事人扶持之兆也。",
            "explain": "土人来占必得名，生意买卖也兴隆，匠艺之人交易也，庄农逢之好收成。 "
        },
        {
            "id": "111010",
            "name": "地火明夷卦：过河拆桥",
            "saying": "时乖运拙走不着，急忙过河拆了桥。恩人无义反为怨，凡事无功枉受劳。",
            "deduct": "行人未至，头绪不清，口舌紧避，凡事小心。",
            "deductDesc": "夷者伤也，明而见伤，故有过河拆桥之象也。所谓过河拆桥者，如同与人修桥渡河，不想人先过去，将桥拆掉，不能前进，占此卦者，主临事难为，多有不顺之兆也。",
            "explain": "时第六运拙定水着，急忙过河拆了桥，恩人无义反为怨，凡事无功主受劳。 "
        },
        {
            "id": "111011",
            "name": "地山谦卦：二人分金",
            "saying": "天赐贫人一封金，不用争来二人分。彼此分得金到手，一切谋望皆遂心。",
            "deduct": "婚姻遂意，出外得地，交易合伙，无不吉利。",
            "deductDesc": "谦者谦让也，有相不居，故有二人分金之象也。夫二人分金者，而是两个穷人，同患难不分你我，勿拾到钱一挂，随即二人分之。毫不相争，占此卦者，百事通泰之兆也。",
            "explain": "天赐穷人一挂金，不争不竟两平分，彼此分得金到手，一切谋望皆遂心。 "
        },
        {
            "id": "111100",
            "name": "地泽临卦：发政施仁",
            "saying": "发政施仁志量高，出外求财任逍遥。交易婚姻大有意，走失行人有信耗。",
            "deduct": "口舌消散，疾病即痊，求名称意，家宅平安。",
            "deductDesc": "临者上临下也，坤居兑土，似临民之间，故有发政施仁之象。夫发政施仁者，是商朝百姓被纣王暴虐如在涂炭之中，忽然文王大修其政，重其安居，占此卦者，时运亨通之兆也。",
            "explain": "君王无道民倒悬，常想拔云见晴天，幸逢明主施仁政，重又安居乐自然。 "
        },
        {
            "id": "111101",
            "name": "地水师卦：马到成功",
            "saying": "将帅领旨去出征，骑着烈马拉硬弓。百步穿杨去的准，箭射金钱喜气生。",
            "deduct": "疾病大好，走失能找，行人有信，白事凑巧。",
            "deductDesc": "师者，其从也，战无不克也，故有马到成功之象。夫马到成功者，如同一个将军，奉命征伐贼寇，闯进营去，大获全胜，占得此卦者，诸事成全之兆也。",
            "explain": "将军领旨去出征，骑着大马拉硬弓，百步穿杨射得准，箭落金钱喜气生。 "
        },
        {
            "id": "111110",
            "name": "地雷复卦：夫妻反目",
            "saying": "若占此卦不相和，忧疑愁闲无定夺。恩人无义反成怨，是非平地起风波。",
            "deduct": "寻人不见，心事不定，交节换月，自然安宁。",
            "deductDesc": "覆者反也，反复不定，故有夫妻反目之象也。夫妻反目者，是姜子牙久不遇时，甚是穷困，马氏不贤，常常争吵，占此卦者，主同人不合，反目无情之兆也。",
            "explain": "马氏太公不相合，进入古之忧疑多，因人无义反为怨，是非平地起风波。 "
        },
        {
            "id": "111111",
            "name": "坤为地卦：饿虎得食",
            "saying": "饿虎得食喜气欢，求名应事主高迁。出门吉利行人到，是非口舌不相干。",
            "deduct": "找人得见，走失有信，疾病见好，凡事皆顺。",
            "deductDesc": "坤者顺也，内外纯阴，其性柔顺，故有饿虎得食之象也。夫饿虎得食者，乃是一只猛虎，腹中饥饿，走去寻食，不炒一只肥羊失群，送到面前，虎捕而食之，占此卦者，遂心如意之兆。",
            "explain": "肥羊失群入山岗，饿虎食之把口张，适物充肠心欢喜，卦若占之大喜昌。"
        }
    ]
    // document.getElementById("arrayPrint").innerHTML = JSON.stringify(book, null, 2);

const throwBtn = document.getElementById("throw")
const okayBtn = document.getElementById("okay");
const instruction = document.querySelector(".instruction");
const answer = document.querySelector(".answer");
const coinSet = document.querySelectorAll(".coin");

const guaTitle = document.querySelector(".gua-title");
const guaSaying = document.querySelector(".gua-saying");
const guaDeduct = document.querySelector(".gua-deduct");
const guaDeductDesc = document.querySelector(".gua-deductDesc");
const guaExplain = document.querySelector(".gua-explain");

// var coins = "";

function checkGua(coins) {
    book.forEach(function(item) {
        if (item.id == coins) {
            console.log(item.name);
            guaTitle.innerText = item.name;
            guaSaying.innerText = item.saying;
            guaDeduct.innerText = item.deduct;
            guaDeductDesc.innerText = item.deductDesc;
            guaExplain.innerText = item.explain;
        }
    })
}

function reset() {
    coins = "";
    resetCoin();

    guaTitle.innerText = "";
    guaSaying.innerText = "";
    guaDeduct.innerText = "";
    guaDeductDesc.innerText = "";
    guaExplain.innerText = "";

    throwBtn.classList.add("show");
    instruction.classList.add("show");
    okayBtn.classList.remove("show");
    answer.classList.remove("show");
}


throwBtn.addEventListener('click', function() {
    throwBtn.classList.remove("show");
    // instruction.innerText = "go away";
    instruction.classList.remove("show");
    okayBtn.classList.add("show");
    answer.classList.add("show");

    console.log(instruction.classList);
    checkGua(flipCoin());
});

okayBtn.addEventListener('click', reset)

function flipCoin() {
    coins = "";
    for (let i = 0; i < 6; i++) {
        coins += Math.floor(Math.random() * 2).toString();
    }
    console.log("Your reading: " + coins)
    setCoin(coins);
    return coins;
}

function setCoin(coins) {
    for (let i = 0; i < coins.length; i++) {
        if (coins.charAt(i) == 0) {
            coinSet[i].classList.add("coin-light");
        } else {
            coinSet[i].classList.add("coin-dark");
        }
        coinSet[i].classList.remove("coin-flip");
    }
}

function resetCoin() {
    coinSet.forEach(function(coin) {
        coin.classList.remove("coin-light");
        coin.classList.remove("coin-dark");
        coin.classList.add("coin-flip");
    })
}